Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_ENETC_SI.h
#define ENETC_SI_SIPCAPR1_NUM_TCS_MASK           (0x70U)
#define ENETC_SI_SIPCAPR1_NUM_TCS_SHIFT          (4U)
#define ENETC_SI_SIPCAPR1_NUM_TCS(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_TCS_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_TCS_MASK)

#define ENETC_SI_SIPCAPR1_NUM_MCH_MASK           (0x300U)
#define ENETC_SI_SIPCAPR1_NUM_MCH_SHIFT          (8U)
#define ENETC_SI_SIPCAPR1_NUM_MCH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_MCH_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_MCH_MASK)

#define ENETC_SI_SIPCAPR1_NUM_UCH_MASK           (0xC00U)
#define ENETC_SI_SIPCAPR1_NUM_UCH_SHIFT          (10U)
#define ENETC_SI_SIPCAPR1_NUM_UCH(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_UCH_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_UCH_MASK)

#define ENETC_SI_SIPCAPR1_NUM_MSIX_MASK          (0x3F000U)
#define ENETC_SI_SIPCAPR1_NUM_MSIX_SHIFT         (12U)
#define ENETC_SI_SIPCAPR1_NUM_MSIX(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_MSIX_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_MSIX_MASK)

#define ENETC_SI_SIPCAPR1_NUM_IPV_MASK           (0x80000000U)
#define ENETC_SI_SIPCAPR1_NUM_IPV_SHIFT          (31U)
#define ENETC_SI_SIPCAPR1_NUM_IPV(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIPCAPR1_NUM_IPV_SHIFT)) & ENETC_SI_SIPCAPR1_NUM_IPV_MASK)
/*! @} */

/*! @name SITSR - Station interface timer status register */
/*! @{ */

#define ENETC_SI_SITSR_SYNC_MASK                 (0x1U)
#define ENETC_SI_SITSR_SYNC_SHIFT                (0U)
/*! SYNC - Timer synchronization */
#define ENETC_SI_SITSR_SYNC(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITSR_SYNC_SHIFT)) & ENETC_SI_SITSR_SYNC_MASK)

#define ENETC_SI_SITSR_PARAM_VAL_MASK            (0xFFFFFFFEU)
#define ENETC_SI_SITSR_PARAM_VAL_SHIFT           (1U)
/*! PARAM_VAL - User specific parameter values */
#define ENETC_SI_SITSR_PARAM_VAL(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITSR_PARAM_VAL_SHIFT)) & ENETC_SI_SITSR_PARAM_VAL_MASK)
/*! @} */

/*! @name SIRBGCR - Station interface receive BDR group control register */
/*! @{ */

#define ENETC_SI_SIRBGCR_NUM_GROUPS_MASK         (0x3U)
#define ENETC_SI_SIRBGCR_NUM_GROUPS_SHIFT        (0U)
#define ENETC_SI_SIRBGCR_NUM_GROUPS(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRBGCR_NUM_GROUPS_SHIFT)) & ENETC_SI_SIRBGCR_NUM_GROUPS_MASK)

#define ENETC_SI_SIRBGCR_RINGS_PER_GROUP_MASK    (0x70000U)
#define ENETC_SI_SIRBGCR_RINGS_PER_GROUP_SHIFT   (16U)
#define ENETC_SI_SIRBGCR_RINGS_PER_GROUP(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIRBGCR_RINGS_PER_GROUP_SHIFT)) & ENETC_SI_SIRBGCR_RINGS_PER_GROUP_MASK)
/*! @} */

/*! @name SIBCAR - Station interface buffer cache attribute register */
/*! @{ */

#define ENETC_SI_SIBCAR_BD_WRCACHE_MASK          (0xFU)
#define ENETC_SI_SIBCAR_BD_WRCACHE_SHIFT         (0U)
#define ENETC_SI_SIBCAR_BD_WRCACHE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_WRCACHE_SHIFT)) & ENETC_SI_SIBCAR_BD_WRCACHE_MASK)

#define ENETC_SI_SIBCAR_BD_WRDOMAIN_MASK         (0x30U)
#define ENETC_SI_SIBCAR_BD_WRDOMAIN_SHIFT        (4U)
#define ENETC_SI_SIBCAR_BD_WRDOMAIN(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_WRDOMAIN_SHIFT)) & ENETC_SI_SIBCAR_BD_WRDOMAIN_MASK)

#define ENETC_SI_SIBCAR_BD_WRSNP_MASK            (0x40U)
#define ENETC_SI_SIBCAR_BD_WRSNP_SHIFT           (6U)
#define ENETC_SI_SIBCAR_BD_WRSNP(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_WRSNP_SHIFT)) & ENETC_SI_SIBCAR_BD_WRSNP_MASK)

#define ENETC_SI_SIBCAR_WRCACHE_MASK             (0xF00U)
#define ENETC_SI_SIBCAR_WRCACHE_SHIFT            (8U)
#define ENETC_SI_SIBCAR_WRCACHE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_WRCACHE_SHIFT)) & ENETC_SI_SIBCAR_WRCACHE_MASK)

#define ENETC_SI_SIBCAR_WRDOMAIN_MASK            (0x3000U)
#define ENETC_SI_SIBCAR_WRDOMAIN_SHIFT           (12U)
#define ENETC_SI_SIBCAR_WRDOMAIN(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_WRDOMAIN_SHIFT)) & ENETC_SI_SIBCAR_WRDOMAIN_MASK)

#define ENETC_SI_SIBCAR_WRSNP_MASK               (0x4000U)
#define ENETC_SI_SIBCAR_WRSNP_SHIFT              (14U)
#define ENETC_SI_SIBCAR_WRSNP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_WRSNP_SHIFT)) & ENETC_SI_SIBCAR_WRSNP_MASK)

#define ENETC_SI_SIBCAR_BD_RDCACHE_MASK          (0xF0000U)
#define ENETC_SI_SIBCAR_BD_RDCACHE_SHIFT         (16U)
#define ENETC_SI_SIBCAR_BD_RDCACHE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_RDCACHE_SHIFT)) & ENETC_SI_SIBCAR_BD_RDCACHE_MASK)

#define ENETC_SI_SIBCAR_BD_RDDOMAIN_MASK         (0x300000U)
#define ENETC_SI_SIBCAR_BD_RDDOMAIN_SHIFT        (20U)
#define ENETC_SI_SIBCAR_BD_RDDOMAIN(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_RDDOMAIN_SHIFT)) & ENETC_SI_SIBCAR_BD_RDDOMAIN_MASK)

#define ENETC_SI_SIBCAR_BD_RDSNP_MASK            (0x400000U)
#define ENETC_SI_SIBCAR_BD_RDSNP_SHIFT           (22U)
#define ENETC_SI_SIBCAR_BD_RDSNP(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_BD_RDSNP_SHIFT)) & ENETC_SI_SIBCAR_BD_RDSNP_MASK)

#define ENETC_SI_SIBCAR_RDCACHE_MASK             (0xF000000U)
#define ENETC_SI_SIBCAR_RDCACHE_SHIFT            (24U)
#define ENETC_SI_SIBCAR_RDCACHE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_RDCACHE_SHIFT)) & ENETC_SI_SIBCAR_RDCACHE_MASK)

#define ENETC_SI_SIBCAR_RDDOMAIN_MASK            (0x30000000U)
#define ENETC_SI_SIBCAR_RDDOMAIN_SHIFT           (28U)
#define ENETC_SI_SIBCAR_RDDOMAIN(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_RDDOMAIN_SHIFT)) & ENETC_SI_SIBCAR_RDDOMAIN_MASK)

#define ENETC_SI_SIBCAR_RDSNP_MASK               (0x40000000U)
#define ENETC_SI_SIBCAR_RDSNP_SHIFT              (30U)
#define ENETC_SI_SIBCAR_RDSNP(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIBCAR_RDSNP_SHIFT)) & ENETC_SI_SIBCAR_RDSNP_MASK)
/*! @} */

/*! @name SIMCAR - Station interface message cache attribute register */
/*! @{ */

#define ENETC_SI_SIMCAR_MSG_WRCACHE_MASK         (0xFU)
#define ENETC_SI_SIMCAR_MSG_WRCACHE_SHIFT        (0U)
#define ENETC_SI_SIMCAR_MSG_WRCACHE(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_WRCACHE_SHIFT)) & ENETC_SI_SIMCAR_MSG_WRCACHE_MASK)

#define ENETC_SI_SIMCAR_MSG_WRDOMAIN_MASK        (0x30U)
#define ENETC_SI_SIMCAR_MSG_WRDOMAIN_SHIFT       (4U)
#define ENETC_SI_SIMCAR_MSG_WRDOMAIN(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_WRDOMAIN_SHIFT)) & ENETC_SI_SIMCAR_MSG_WRDOMAIN_MASK)

#define ENETC_SI_SIMCAR_MSG_WRSNP_MASK           (0x40U)
#define ENETC_SI_SIMCAR_MSG_WRSNP_SHIFT          (6U)
#define ENETC_SI_SIMCAR_MSG_WRSNP(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIMCAR_MSG_WRSNP_SHIFT)) & ENETC_SI_SIMCAR_MSG_WRSNP_MASK)

