Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_ENETC_SI.h
/*! @name SIVLANIPVMR0 - Station interface VLAN to IPV mapping register 0 */
/*! @{ */

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_0_MASK     (0xFU)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_0_SHIFT    (0U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_0(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_0_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_0_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_1_MASK     (0xF0U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_1_SHIFT    (4U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_1(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_1_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_1_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_2_MASK     (0xF00U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_2_SHIFT    (8U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_2(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_2_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_2_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_3_MASK     (0xF000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_3_SHIFT    (12U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_3(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_3_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_3_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_4_MASK     (0xF0000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_4_SHIFT    (16U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_4(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_4_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_4_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_5_MASK     (0xF00000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_5_SHIFT    (20U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_5(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_5_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_5_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_6_MASK     (0xF000000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_6_SHIFT    (24U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_6(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_6_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_6_MASK)

#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_7_MASK     (0xF0000000U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_7_SHIFT    (28U)
#define ENETC_SI_SIVLANIPVMR0_PCP_DEI_7(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR0_PCP_DEI_7_SHIFT)) & ENETC_SI_SIVLANIPVMR0_PCP_DEI_7_MASK)
/*! @} */

/*! @name SIVLANIPVMR1 - Station interface VLAN to IPV mapping register 1 */
/*! @{ */

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_8_MASK     (0xFU)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_8_SHIFT    (0U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_8(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_8_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_8_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_9_MASK     (0xF0U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_9_SHIFT    (4U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_9(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_9_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_9_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_10_MASK    (0xF00U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_10_SHIFT   (8U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_10(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_10_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_10_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_11_MASK    (0xF000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_11_SHIFT   (12U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_11(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_11_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_11_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_12_MASK    (0xF0000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_12_SHIFT   (16U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_12(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_12_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_12_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_13_MASK    (0xF00000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_13_SHIFT   (20U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_13(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_13_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_13_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_14_MASK    (0xF000000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_14_SHIFT   (24U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_14(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_14_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_14_MASK)

#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_15_MASK    (0xF0000000U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_15_SHIFT   (28U)
#define ENETC_SI_SIVLANIPVMR1_PCP_DEI_15(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIVLANIPVMR1_PCP_DEI_15_SHIFT)) & ENETC_SI_SIVLANIPVMR1_PCP_DEI_15_MASK)
/*! @} */

/*! @name SIIPVBDRMR0 - Station interface IPV to ring mapping register */
/*! @{ */

#define ENETC_SI_SIIPVBDRMR0_IPV0BDR_MASK        (0x7U)
#define ENETC_SI_SIIPVBDRMR0_IPV0BDR_SHIFT       (0U)
#define ENETC_SI_SIIPVBDRMR0_IPV0BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV0BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV0BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV1BDR_MASK        (0x70U)
#define ENETC_SI_SIIPVBDRMR0_IPV1BDR_SHIFT       (4U)
#define ENETC_SI_SIIPVBDRMR0_IPV1BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV1BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV1BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV2BDR_MASK        (0x700U)
#define ENETC_SI_SIIPVBDRMR0_IPV2BDR_SHIFT       (8U)
#define ENETC_SI_SIIPVBDRMR0_IPV2BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV2BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV2BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV3BDR_MASK        (0x7000U)
#define ENETC_SI_SIIPVBDRMR0_IPV3BDR_SHIFT       (12U)
#define ENETC_SI_SIIPVBDRMR0_IPV3BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV3BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV3BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV4BDR_MASK        (0x70000U)
#define ENETC_SI_SIIPVBDRMR0_IPV4BDR_SHIFT       (16U)
#define ENETC_SI_SIIPVBDRMR0_IPV4BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV4BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV4BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV5BDR_MASK        (0x700000U)
#define ENETC_SI_SIIPVBDRMR0_IPV5BDR_SHIFT       (20U)
#define ENETC_SI_SIIPVBDRMR0_IPV5BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV5BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV5BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV6BDR_MASK        (0x7000000U)
#define ENETC_SI_SIIPVBDRMR0_IPV6BDR_SHIFT       (24U)
#define ENETC_SI_SIIPVBDRMR0_IPV6BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV6BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV6BDR_MASK)

#define ENETC_SI_SIIPVBDRMR0_IPV7BDR_MASK        (0x70000000U)
#define ENETC_SI_SIIPVBDRMR0_IPV7BDR_SHIFT       (28U)
#define ENETC_SI_SIIPVBDRMR0_IPV7BDR(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SIIPVBDRMR0_IPV7BDR_SHIFT)) & ENETC_SI_SIIPVBDRMR0_IPV7BDR_MASK)
/*! @} */

