Masmiseim36/iMXRT/targets/iMXRText/devices/iMXRT1180/periph/PERI_ENETC_SI.h
#define ENETC_SI_VSIIDR_RXR_MASK                 (0x10000U)
#define ENETC_SI_VSIIDR_RXR_SHIFT                (16U)
#define ENETC_SI_VSIIDR_RXR(x)                   (((uint32_t)(((uint32_t)(x)) << ENETC_SI_VSIIDR_RXR_SHIFT)) & ENETC_SI_VSIIDR_RXR_MASK)
/*! @} */

/*! @name SITXIDR0 - Station interface transmit interrupt detect register 0 */
/*! @{ */

#define ENETC_SI_SITXIDR0_TXT0_MASK              (0x1U)
#define ENETC_SI_SITXIDR0_TXT0_SHIFT             (0U)
#define ENETC_SI_SITXIDR0_TXT0(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT0_SHIFT)) & ENETC_SI_SITXIDR0_TXT0_MASK)

#define ENETC_SI_SITXIDR0_TXT1_MASK              (0x2U)
#define ENETC_SI_SITXIDR0_TXT1_SHIFT             (1U)
#define ENETC_SI_SITXIDR0_TXT1(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT1_SHIFT)) & ENETC_SI_SITXIDR0_TXT1_MASK)

#define ENETC_SI_SITXIDR0_TXT2_MASK              (0x4U)
#define ENETC_SI_SITXIDR0_TXT2_SHIFT             (2U)
#define ENETC_SI_SITXIDR0_TXT2(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT2_SHIFT)) & ENETC_SI_SITXIDR0_TXT2_MASK)

#define ENETC_SI_SITXIDR0_TXT3_MASK              (0x8U)
#define ENETC_SI_SITXIDR0_TXT3_SHIFT             (3U)
#define ENETC_SI_SITXIDR0_TXT3(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT3_SHIFT)) & ENETC_SI_SITXIDR0_TXT3_MASK)

#define ENETC_SI_SITXIDR0_TXT4_MASK              (0x10U)
#define ENETC_SI_SITXIDR0_TXT4_SHIFT             (4U)
#define ENETC_SI_SITXIDR0_TXT4(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT4_SHIFT)) & ENETC_SI_SITXIDR0_TXT4_MASK)

#define ENETC_SI_SITXIDR0_TXT5_MASK              (0x20U)
#define ENETC_SI_SITXIDR0_TXT5_SHIFT             (5U)
#define ENETC_SI_SITXIDR0_TXT5(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT5_SHIFT)) & ENETC_SI_SITXIDR0_TXT5_MASK)

#define ENETC_SI_SITXIDR0_TXT6_MASK              (0x40U)
#define ENETC_SI_SITXIDR0_TXT6_SHIFT             (6U)
#define ENETC_SI_SITXIDR0_TXT6(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT6_SHIFT)) & ENETC_SI_SITXIDR0_TXT6_MASK)

#define ENETC_SI_SITXIDR0_TXT7_MASK              (0x80U)
#define ENETC_SI_SITXIDR0_TXT7_SHIFT             (7U)
#define ENETC_SI_SITXIDR0_TXT7(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT7_SHIFT)) & ENETC_SI_SITXIDR0_TXT7_MASK)

#define ENETC_SI_SITXIDR0_TXT8_MASK              (0x100U)
#define ENETC_SI_SITXIDR0_TXT8_SHIFT             (8U)
#define ENETC_SI_SITXIDR0_TXT8(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT8_SHIFT)) & ENETC_SI_SITXIDR0_TXT8_MASK)

#define ENETC_SI_SITXIDR0_TXT9_MASK              (0x200U)
#define ENETC_SI_SITXIDR0_TXT9_SHIFT             (9U)
#define ENETC_SI_SITXIDR0_TXT9(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT9_SHIFT)) & ENETC_SI_SITXIDR0_TXT9_MASK)

#define ENETC_SI_SITXIDR0_TXT10_MASK             (0x400U)
#define ENETC_SI_SITXIDR0_TXT10_SHIFT            (10U)
#define ENETC_SI_SITXIDR0_TXT10(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT10_SHIFT)) & ENETC_SI_SITXIDR0_TXT10_MASK)

#define ENETC_SI_SITXIDR0_TXT11_MASK             (0x800U)
#define ENETC_SI_SITXIDR0_TXT11_SHIFT            (11U)
#define ENETC_SI_SITXIDR0_TXT11(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT11_SHIFT)) & ENETC_SI_SITXIDR0_TXT11_MASK)

#define ENETC_SI_SITXIDR0_TXT12_MASK             (0x1000U)
#define ENETC_SI_SITXIDR0_TXT12_SHIFT            (12U)
#define ENETC_SI_SITXIDR0_TXT12(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT12_SHIFT)) & ENETC_SI_SITXIDR0_TXT12_MASK)

#define ENETC_SI_SITXIDR0_TXT13_MASK             (0x2000U)
#define ENETC_SI_SITXIDR0_TXT13_SHIFT            (13U)
#define ENETC_SI_SITXIDR0_TXT13(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXT13_SHIFT)) & ENETC_SI_SITXIDR0_TXT13_MASK)

#define ENETC_SI_SITXIDR0_TXF0_MASK              (0x10000U)
#define ENETC_SI_SITXIDR0_TXF0_SHIFT             (16U)
#define ENETC_SI_SITXIDR0_TXF0(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF0_SHIFT)) & ENETC_SI_SITXIDR0_TXF0_MASK)

#define ENETC_SI_SITXIDR0_TXF1_MASK              (0x20000U)
#define ENETC_SI_SITXIDR0_TXF1_SHIFT             (17U)
#define ENETC_SI_SITXIDR0_TXF1(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF1_SHIFT)) & ENETC_SI_SITXIDR0_TXF1_MASK)

#define ENETC_SI_SITXIDR0_TXF2_MASK              (0x40000U)
#define ENETC_SI_SITXIDR0_TXF2_SHIFT             (18U)
#define ENETC_SI_SITXIDR0_TXF2(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF2_SHIFT)) & ENETC_SI_SITXIDR0_TXF2_MASK)

#define ENETC_SI_SITXIDR0_TXF3_MASK              (0x80000U)
#define ENETC_SI_SITXIDR0_TXF3_SHIFT             (19U)
#define ENETC_SI_SITXIDR0_TXF3(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF3_SHIFT)) & ENETC_SI_SITXIDR0_TXF3_MASK)

#define ENETC_SI_SITXIDR0_TXF4_MASK              (0x100000U)
#define ENETC_SI_SITXIDR0_TXF4_SHIFT             (20U)
#define ENETC_SI_SITXIDR0_TXF4(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF4_SHIFT)) & ENETC_SI_SITXIDR0_TXF4_MASK)

#define ENETC_SI_SITXIDR0_TXF5_MASK              (0x200000U)
#define ENETC_SI_SITXIDR0_TXF5_SHIFT             (21U)
#define ENETC_SI_SITXIDR0_TXF5(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF5_SHIFT)) & ENETC_SI_SITXIDR0_TXF5_MASK)

#define ENETC_SI_SITXIDR0_TXF6_MASK              (0x400000U)
#define ENETC_SI_SITXIDR0_TXF6_SHIFT             (22U)
#define ENETC_SI_SITXIDR0_TXF6(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF6_SHIFT)) & ENETC_SI_SITXIDR0_TXF6_MASK)

#define ENETC_SI_SITXIDR0_TXF7_MASK              (0x800000U)
#define ENETC_SI_SITXIDR0_TXF7_SHIFT             (23U)
#define ENETC_SI_SITXIDR0_TXF7(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF7_SHIFT)) & ENETC_SI_SITXIDR0_TXF7_MASK)

#define ENETC_SI_SITXIDR0_TXF8_MASK              (0x1000000U)
#define ENETC_SI_SITXIDR0_TXF8_SHIFT             (24U)
#define ENETC_SI_SITXIDR0_TXF8(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_SI_SITXIDR0_TXF8_SHIFT)) & ENETC_SI_SITXIDR0_TXF8_MASK)

